# vsoStateGet

## Description
```pascal
FUNCTION vsoStateGet(
				hObj  : HANDLE;
				state : INTEGER) : BOOLEAN;
```

```python

def vs.vsoStateGet(hObj, state):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|state|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events